app/controllers/mentees_controller.rb

  def index
    @mentees = Mentee.all
---
SELECT "mentees".* FROM "mentees"

  def create
    @mentee = Mentee.new(mentee_params)

    respond_to do |format|
      if @mentee.save
---
INSERT INTO "mentees" ("first_name", "last_name", "university", "email", "skills", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @mentee.destroy
---
DELETE FROM "mentees" WHERE "mentees"."id" = ?  [["id", 1]]

    def set_mentee
      @mentee = Mentee.find(params[:id])
---
SELECT  "mentees".* FROM "mentees" WHERE "mentees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]