app/controllers/mentors_controller.rb

SELECT "mentors".* FROM "mentors"
---
  def index
    @mentors = Mentor.all

INSERT INTO "mentors" ("first_name", "last_name", "email", "skills", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @mentor = Mentor.new(mentor_params)

    respond_to do |format|
      if @mentor.save

UPDATE "mentors" SET "skills" = ?, "updated_at" = ? WHERE "mentors"."id" = ?  [["skills", "Kickboxing, Ruby on Rails, Back-end Web Dev"], ["updated_at", "2017-06-25 06:44:12.347270"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mentor.update(mentor_params)

DELETE FROM "mentors" WHERE "mentors"."id" = ?  [["id", 2]]
---
  def destroy
    @mentor.destroy

SELECT  "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_mentor
      @mentor = Mentor.find(params[:id])